openfoam/templates/wind_tunnel/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Domain decomposition for parallel runs.
// N_PROCS is substituted by setup_case.py (default: 4)

numberOfSubdomains  N_PROCS;

method          scotch;         // automatic load-balanced decomposition

// ************************************************************************* //
